crossref/scenarios/media_get_video_sources.request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  <s:Header><!--WSSE--></s:Header>
  <s:Body>
    <trt:GetVideoSources xmlns:trt="http://www.onvif.org/ver10/media/wsdl"/>
  </s:Body>
</s:Envelope>
