get-profiles.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
 <soap:Body>
 <trt:GetProfiles/>
 </soap:Body>
</soap:Envelope>