app/src/main/assets/GetProfiles

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    %s
    <s:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <GetProfiles xmlns="http://www.onvif.org/ver10/media/wsdl" />
    </s:Body>
</s:Envelope>